backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_5, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 13680]
      dtype: float32
      name: input_5
      sparse: false
    inbound_nodes: []
    name: input_5
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_7
      trainable: true
      units: 3
      use_bias: true
    inbound_nodes:
    - - - input_5
        - 0
        - 0
        - {}
    name: dense_7
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_9
      trainable: true
      units: 13680
      use_bias: true
    inbound_nodes:
    - - - dense_7
        - 0
        - 0
        - {}
    name: dense_9
  name: model_9
  output_layers:
  - [dense_9, 0, 0]
keras_version: 2.1.5
